{
  "name": "My Voice",
  "profile_text": "```json\n{\n  \"name\": \"My Voice\",\n  \"profile_text\": \"The tone is earnest and community-focused, reflecting a deep commitment to addressing local issues with practical solutions. The vocabulary is straightforward yet impactful, emphasizing collaboration and action over rhetoric. The style is direct and informative, with a focus on outlining challenges and presenting clear paths forward, aiming to engage and mobilize the community for collective problem-solving.\",\n  \"created_at\": \"2023-10-05T00:00:00Z\"\n}\n```",
  "created_at": "2025-06-24T01:24:35.230230",
  "samples": [
    "Good afternoon, everyone. \nIt’s always good to be back in District. Driving from the north part of Bakersfield, over through Tehachapi, and all the way up to the end of our district in Trona this morning, I couldn’t feel more humbled and proud to represent this great district and it’s communities. I feel truly blessed. \nSo first, thank you for having me. Not only today, but as your voice in Sacramento.\nI am, as well, honored to share today with folks who genuinely care about our home.\nSo let’s talk.\nHere’s the challenges we are facing:\nWater is life.\nEspecially here in the high desert, and right now, that lifeline is at risk. \nOur Indian Wells Valley aquifer is one of the most critically depleted around. \nEvery year, we pump about 20,000 acre-feet, yet the sustainable rate is far less. At current rates, we have just decades left before it’s all gone. Our taps, farms, businesses, and even China Lake, depend on finding solutions.\nWhat’s our path forward though? \nThe good news is, we have options. Between either agreements with key partners or a pipeline project, there are still options and the crisis can be diverted. Some of the options are more expensive, and others have challenges all their own that will require community buy in. But that’s what we’re doing here today. Coming to the table. We’re painstakingly working through those options, and whichever path emerges as the best to deliver results… I’ll be making sure Sacramento does its part to get it pass the goal line. Hard work always wins.\nSomething else that matters deeply to me and is important to this region, is our Hospital..\nRidgecrest Regional Hospital isn’t just bricks and mortar, it’s a lifeline. Last year, when the Hospital faced a crisis that threatened the closure of Labor and Delivery, it would’ve created a maternity desert. Moms would have to drive hours just to deliver safely. And That’s unacceptable. \nSo we rallied. With help and support from our partners at China Lake and in Washington, we got federal funding to reopen the maternity ward. But we can’t rest there. We have to keep it open now. And not only that, we need to build it bigger and better.\nRural hospitals, like ours, need sustainable funding. I’m committed to making sure Sacramento never forgets that Ridgecrest matters as much as Los Angeles or San Francisco. Because healthcare shouldn’t be political… It's just common sense.\nNow, speaking of China Lake. \nThis base isn’t just part of the local economy, it’s the heartbeat. After the devastating 2019 earthquakes, we’ve rebuilt smarter and stronger, thanks to federal funding secured by Kern’s own congressional delegation. Today, what we lost at China Lake is almost completely rebuilt, securing hundreds of local jobs, pumping money into our economy. It’s proof of what we accomplish when local, state, and federal leaders roll up our sleeves and get to work. We’re not waiting on Sacramento to fix this, if they get in the way we’re still going to get it done. \nOur National security as well as our local safety. Public safety is front of mind. \nRidgecrest Police recently led a successful operation taking guns, fentanyl, and criminals off our streets. That’s the kind of proactive work I will always support. In Sacramento, I’m advocating for our fair share of public safety funding, making sure our officers have the resources they need to protect us all. Because safety isn’t optional, it’s non-negotiable.\nI know you agree, because you care about the life and future of our community. You are invested in strengthening not only public safety and access to basic needs of water and healthcare, but the local economy as well. \nRidgecrest’s future depends on diversifying our economy. \nI’ve authored AB 940, creating Quantum Innovation Zones. Big tech shouldn’t be limited to Silicon Valley. Let’s bring high-paying, innovative jobs right here to our Valley where some of the brightest minds and hardest workers live. \nAnd while we all invest in our future economy, I will be pushing to cut red tape that’s hurting our small businesses. That’s where real economic growth happens: mom-and-pop shops, local entrepreneurs, and community investments.\nLots of people have asked me, “How are you liking it?”\nMy answer is “It’s bittersweet.”\nThere’s the good, the bad, and the really ugly.\nThe real work isn’t flashy and isn’t about politicians grandstanding to get more views. The real work is doing what’s practical, meaningful, and getting results. Like all of you local leaders here today, I don’t believe in exaggerated slogans or ideological fights. What matters is solving problems and getting the job done.\nWhy?\nBecause Ridgecrest isn’t just a spot on the map, it’s our home, our heritage, our responsibility. From securing water and healthcare to supporting our economy and safety, the task ahead needs all of us. Let's just get the thing done already!\nNow, that’s all I want to say. You may be here to hear from me, but I’m really here to hear from you.\nHow can I help?\nIntroduction\nGrateful to represent our community—from Bakersfield through Tehachapi up to Trona.\nHonored to be your voice in Sacramento and to join leaders who care deeply about our home.\nWater Crisis\nOur lifeline: Indian Wells Valley aquifer critically depleted.\nCurrent use: ~20,000 acre-feet annually, unsustainable; we have decades left, at most.\nMust secure water for taps, farms, businesses, and China Lake.\nPath Forward on Water\nExploring viable solutions:\nAgreements with key stakeholders.\nPossible pipeline from California Aqueduct.\nAll solutions require community involvement and consensus.\nCommitment: Ensure Sacramento supports whichever practical solution we choose.\nMantra: \"Hard work always wins.\"\nRidgecrest Regional Hospital\nHospital isn't just bricks and mortar—it's a community lifeline.\nPast crisis: Potential closure of Labor and Delivery unit creating maternity desert was unacceptable.\nSuccessfully secured federal funding through partnerships (China Lake, federal reps).\nCommitment: Sustain funding, expand services, and upgrade hospital facilities.\nBelief: Healthcare access shouldn't be political—it's common sense.\nChina Lake Naval Air Weapons Station\nChina Lake is the economic heartbeat of Ridgecrest.\nPost-2019 earthquakes, successful rebuild nearly complete, thanks to federal funds.\nHundreds of local jobs created; significant local economic impact.\nMessage: We don’t wait on Sacramento—local and federal collaboration gets results.\nPublic Safety\nPublic safety is non-negotiable; vital for community wellbeing.\nRidgecrest Police proactively removing guns, fentanyl, criminals from streets.\nCommitment: Advocate in Sacramento for fair share of public safety resources.\nLocal Economy & Jobs\nRidgecrest’s future depends on economic diversification.\nAuthored AB 940 (Quantum Innovation Zones) to attract innovative, high-paying jobs.\nBig tech opportunities shouldn't be exclusive to Silicon Valley.\nOngoing priority: Cutting red tape for small businesses, the true engines of growth.\nLegislative Realities & Commitment\nSacramento service is \"bittersweet\": good, bad, and really ugly.\nReal work isn't flashy—it’s practical, meaningful, and gets tangible results.\nPriority: Problem-solving and practical action, not political grandstanding.\nConclusion & Invitation\nRidgecrest isn’t just a place—it’s our home, heritage, and responsibility.\nCommitment to securing water, healthcare, economy, and safety.\nFocused on practical solutions, working collaboratively with the community.\nNow ready to hear directly from local leaders: \"How can I help?\"\nFact Sheet\n\nWater Security in the Indian Wells Valley\nIndian Wells Valley aquifer critically overdrafted; projected to run dry within ~40 years.\nIWV Groundwater Authority proposed a 50-mile pipeline from California Aqueduct; costs estimated at $200–$350 million.\nCongress authorized initial $50 million funding; IWV residents face replenishment fee of ~$2,100 per acre-foot.\nWater district filed adjudication lawsuit challenging sustainability plan; court resolution may take up to 10 years.\nControversial bills AB 1413 & AB 1466 aim to limit court interference in groundwater sustainability efforts.\n\nLegislative Updates Impacting Ridgecrest\nAB 1413 & AB 1466: Would reinforce groundwater sustainability plans; controversial among agricultural stakeholders.\nAB 1227: Ellis co-authored wildfire safety bill; streamlines fuel reduction projects.\nAB 940: Ellis-authored bill creates “Quantum Innovation Zones” to attract tech investment statewide.\n\nRidgecrest Regional Hospital (RRH)\nRRH faced severe financial crises; secured $5.5 million state emergency loan in 2023.\nTemporarily suspended Labor & Delivery in 2024 due to staff shortages; reopened after Navy provided funding.\nNavy partnership created emergency funding model supporting OB/GYN services critical for local military families.\nContinued risk of financial instability; advocating for long-term state and federal solutions.\nPrioritizing rural healthcare funding and policy solutions to keep RRH operational permanently.\n\nChina Lake Naval Air Weapons Station\nEconomic anchor of Ridgecrest region; significant local employer with annual multimillion-dollar impact.\nRebuilding nearly complete (85%) after $4 billion damage from 2019 earthquakes.\nFederal investment of nearly $4 billion included new quake-resistant facilities; massive local economic stimulus.\nIn 2023, Temporary housing built for reconstruction workforce; $122 million spent locally, creating ~200 local jobs.\nAdvocating for continued state-federal collaboration, infrastructure support, and long-term sustainability.\n\n\nLocal Economy\nRidgecrest unemployment at 3.8%, lower than state average (5.3%); driven by base-related jobs and reconstruction. (April 2025)\nCity actively recruiting new businesses, revitalizing downtown, improving infrastructure and traffic safety.\nSupport rural economic initiatives, including small business support and reducing regulatory barriers.\nPromoting regional tech and renewable energy industries to diversify local job market.\nAuthored AB 940 to establish innovation zones, aiming for future tech job creation in rural areas.\n\nPublic Safety & Emergency Preparedness\nRidgecrest Police led major 2025 operation arresting 24 suspects; significant drug, gun seizures.\nLocal crime primarily involves property theft and drugs, especially fentanyl; proactive law enforcement essential.\nEmergency preparedness significantly improved since 2019 earthquakes; new buildings quake-resistant up to 9.0.\nAdvocating for state funding to support local emergency preparedness, policing, and response systems.\nSupporting improved local traffic safety, including school zone upgrades and pedestrian protections.\n\n\nRecent Legislation & Actions\nAB 940 (Quantum Innovation Zones): Promotes statewide investment in high-tech jobs.\nAB 1227 (Wildfire Fuel Reduction): Streamlines wildfire prevention projects.\nAdvocating strongly for rural healthcare funding and hospital sustainability measures (e.g., RRH support).\nCo-authored resolutions highlighting local values: Military Appreciation, Small Business, Public Safety.\nActively engaging with constituents and local agencies on issues like water sustainability, healthcare, public safety, and economic growth.\n"
  ]
}